# IsPrimary Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConnectorElement..::..IsPrimary Property
ConnectorElement Class See Also
---
Identifies if this is the primary connector in the family.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsPrimary { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsPrimary As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsPrimary {
	bool get ();
}
```

# See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace